/*********************************************************************/
/* INQUIRY FORNITORE/ARTICOLO                                        */
/*********************************************************************/
/* §§ */
             PGM
             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
             CALL       PGM(§BAI52) PARM(&KPJBA)
/* §§ */
             ENDPGM
