/*********************************************************************/
/* INQUIRY CLIENTE/ARTICOLO                                          */
/*********************************************************************/
/* §§ */
             PGM
             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
             CALL       PGM(§BAI51) PARM(&KPJBA)
/* §§ */
             ENDPGM
