/***************************************************************/
/* RICHIAMO STAMPA ETICHETTE LIBERE BMW                        */
/***************************************************************/
/* §§ */
             PGM        PARM(&KPJBA)
             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
             OVRPRTF    FILE(QSYSLABC) OUTQ(INT16) HOLD(*YES) SAVE(*YES)
 /**/
NOSELE:
 /*_________________________________________________________________*/
             CALL       §BMWETI2 PARM(&KPJBA)
 /*_________________________________________________________________*/
/* §§ */
             ENDPGM
